qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/hal/TARGET_Freescale/TARGET_KPSDK_MCUS/TARGET_MCU_K64F/device/device/MK64F12/MK64F12_sdhc.h
/*******************************************************************************
 * HW_SDHC_HOSTVER - Host Controller Version
 ******************************************************************************/

/*!
 * @brief HW_SDHC_HOSTVER - Host Controller Version (RO)
 *
 * Reset value: 0x00001201U
 *
 * This register contains the vendor host controller version information. All
 * bits are read only and will read the same as the power-reset value.
 */
typedef union _hw_sdhc_hostver
{
    uint32_t U;
    struct _hw_sdhc_hostver_bitfields
    {
        uint32_t SVN : 8;              /*!< [7:0] Specification Version Number */
        uint32_t VVN : 8;              /*!< [15:8] Vendor Version Number */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_sdhc_hostver_t;

/*!
 * @name Constants and macros for entire SDHC_HOSTVER register
 */
/*@{*/
#define HW_SDHC_HOSTVER_ADDR(x)  ((x) + 0xFCU)

#define HW_SDHC_HOSTVER(x)       (*(__I hw_sdhc_hostver_t *) HW_SDHC_HOSTVER_ADDR(x))
#define HW_SDHC_HOSTVER_RD(x)    (HW_SDHC_HOSTVER(x).U)
/*@}*/

/*
 * Constants & macros for individual SDHC_HOSTVER bitfields
 */

/*!
 * @name Register SDHC_HOSTVER, field SVN[7:0] (RO)
 *
 * These status bits indicate the host controller specification version.
 *
 * Values:
 * - 1 - SD host specification version 2.0, supports test event register and
 *     ADMA.
 */
/*@{*/
#define BP_SDHC_HOSTVER_SVN  (0U)          /*!< Bit position for SDHC_HOSTVER_SVN. */
#define BM_SDHC_HOSTVER_SVN  (0x000000FFU) /*!< Bit mask for SDHC_HOSTVER_SVN. */
#define BS_SDHC_HOSTVER_SVN  (8U)          /*!< Bit field size in bits for SDHC_HOSTVER_SVN. */

/*! @brief Read current value of the SDHC_HOSTVER_SVN field. */
#define BR_SDHC_HOSTVER_SVN(x) (HW_SDHC_HOSTVER(x).B.SVN)
/*@}*/

/*!
 * @name Register SDHC_HOSTVER, field VVN[15:8] (RO)
 *
 * These status bits are reserved for the vendor version number. The host driver
 * shall not use this status.
 *
 * Values:
 * - 0 - Freescale SDHC version 1.0
 * - 10000 - Freescale SDHC version 2.0
 * - 10001 - Freescale SDHC version 2.1
 * - 10010 - Freescale SDHC version 2.2
 */
/*@{*/
#define BP_SDHC_HOSTVER_VVN  (8U)          /*!< Bit position for SDHC_HOSTVER_VVN. */
#define BM_SDHC_HOSTVER_VVN  (0x0000FF00U) /*!< Bit mask for SDHC_HOSTVER_VVN. */
#define BS_SDHC_HOSTVER_VVN  (8U)          /*!< Bit field size in bits for SDHC_HOSTVER_VVN. */

/*! @brief Read current value of the SDHC_HOSTVER_VVN field. */
#define BR_SDHC_HOSTVER_VVN(x) (HW_SDHC_HOSTVER(x).B.VVN)
/*@}*/

/*******************************************************************************
 * hw_sdhc_t - module struct
 ******************************************************************************/
/*!
 * @brief All SDHC module registers.
 */
#pragma pack(1)
typedef struct _hw_sdhc
{
    __IO hw_sdhc_dsaddr_t DSADDR;          /*!< [0x0] DMA System Address register */
    __IO hw_sdhc_blkattr_t BLKATTR;        /*!< [0x4] Block Attributes register */
    __IO hw_sdhc_cmdarg_t CMDARG;          /*!< [0x8] Command Argument register */
    __IO hw_sdhc_xfertyp_t XFERTYP;        /*!< [0xC] Transfer Type register */
    __I hw_sdhc_cmdrsp0_t CMDRSP0;         /*!< [0x10] Command Response 0 */
    __I hw_sdhc_cmdrsp1_t CMDRSP1;         /*!< [0x14] Command Response 1 */
    __I hw_sdhc_cmdrsp2_t CMDRSP2;         /*!< [0x18] Command Response 2 */
    __I hw_sdhc_cmdrsp3_t CMDRSP3;         /*!< [0x1C] Command Response 3 */
    __IO hw_sdhc_datport_t DATPORT;        /*!< [0x20] Buffer Data Port register */
    __I hw_sdhc_prsstat_t PRSSTAT;         /*!< [0x24] Present State register */
    __IO hw_sdhc_proctl_t PROCTL;          /*!< [0x28] Protocol Control register */
    __IO hw_sdhc_sysctl_t SYSCTL;          /*!< [0x2C] System Control register */
    __IO hw_sdhc_irqstat_t IRQSTAT;        /*!< [0x30] Interrupt Status register */
    __IO hw_sdhc_irqstaten_t IRQSTATEN;    /*!< [0x34] Interrupt Status Enable register */
    __IO hw_sdhc_irqsigen_t IRQSIGEN;      /*!< [0x38] Interrupt Signal Enable register */
    __I hw_sdhc_ac12err_t AC12ERR;         /*!< [0x3C] Auto CMD12 Error Status Register */
    __I hw_sdhc_htcapblt_t HTCAPBLT;       /*!< [0x40] Host Controller Capabilities */
    __IO hw_sdhc_wml_t WML;                /*!< [0x44] Watermark Level Register */
    uint8_t _reserved0[8];
    __O hw_sdhc_fevt_t FEVT;               /*!< [0x50] Force Event register */
    __I hw_sdhc_admaes_t ADMAES;           /*!< [0x54] ADMA Error Status register */
    __IO hw_sdhc_adsaddr_t ADSADDR;        /*!< [0x58] ADMA System Addressregister */
    uint8_t _reserved1[100];
    __IO hw_sdhc_vendor_t VENDOR;          /*!< [0xC0] Vendor Specific register */
    __IO hw_sdhc_mmcboot_t MMCBOOT;        /*!< [0xC4] MMC Boot register */
    uint8_t _reserved2[52];
    __I hw_sdhc_hostver_t HOSTVER;         /*!< [0xFC] Host Controller Version */
} hw_sdhc_t;
#pragma pack()

/*! @brief Macro to access all SDHC registers. */
/*! @param x SDHC module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_SDHC(SDHC_BASE)</code>. */
#define HW_SDHC(x)     (*(hw_sdhc_t *)(x))

#endif /* __HW_SDHC_REGISTERS_H__ */
/* EOF */
